app/controllers/short_urls_controller.rb

  def create
      @short_url = ShortUrl.new(short_url_params)
  		if @short_url.save #esta linea ejecuta un obj.save q devuelve un booleano, si es true...
  			redirect_to "short_url#index" # nos redirija a ese short_url
---
INSERT INTO "short_urls" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "ftp.synergie.es"], ["created_at", "2017-05-22 16:50:15.132064"], ["updated_at", "2017-05-22 16:50:15.132064"]]

  def index
    @short_url = ShortUrl.all
---
SELECT "short_urls".* FROM "short_urls"

  def show
    @short_url = ShortUrl.find(params[:id])
---
SELECT  "short_urls".* FROM "short_urls" WHERE "short_urls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def admin
    @short_url = ShortUrl.all
---
SELECT "short_urls".* FROM "short_urls"